4.9 Pivot Table & Crosstab trong Pandas

Load cơ sở dữ liệu Titanic vf hiển thi 5 mẫu đầu tiên

In [2]:
import pandas as pd
import seaborn as sns

# Nạp dữ liệu Titanic
titanic_data = sns.load_dataset("titanic")

# Hiển thị một số mẫu dữ liệu
titanic_data.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

4.9.1.1 Đặt vấn đề

In [3]:
titanic_data.groupby("sex")["age"].mean()

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

tổng hợp dữ liệu bằng GroupBy (theo TLHT)

In [4]:
gb_age = titanic_data.groupby(["sex", "class"])["age"].mean()
gb_age_unstack = gb_age.unstack()
gb_age_unstack

C:\Users\Admin\AppData\Local\Temp\ipykernel_21004\1574282673.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  gb_age = titanic_data.groupby(["sex", "class"])["age"].mean()

class       First     Second      Third
sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

4.9.1.2 Khái niệm Pivot Table